app/services/github_service.rb

	def save_repository_from_response(repository_hash)
		return if Repository.exists?(github_id: repository_hash['id'])

		repo = Repository.new
		repo.github_id = repository_hash['id']
		repo.name = repository_hash['name']
		repo.full_name = repository_hash['full_name']
		repo.private = repository_hash['private']
		repo.html_url = repository_hash['html_url']
		repo.description = repository_hash['description']
		repo.fork = repository_hash['fork']
		repo.open_issues = repository_hash['open_issues']
		repo.watchers = repository_hash['watchers']
		repo.score = repository_hash['score']
		repo.language = repository_hash['language']

		#TODO: this is bad code
		owner = create_owner_from_response(repository_hash['owner'])
		owner.save

		repo.owner = owner
		repo.save
---
SELECT "repositories".* FROM "repositories" WHERE "repositories"."github_id" = $1 LIMIT $2  [["github_id", 132464395], ["LIMIT", 1]]
SELECT 1 AS one FROM "repositories" WHERE "repositories"."github_id" = $1 LIMIT $2  [["github_id", 121395510], ["LIMIT", 1]]
INSERT INTO "owners" ("external_id", "url", "html_url", "created_at", "updated_at", "login") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "repositories" ("github_id", "name", "full_name", "private", "html_url", "description", "fork", "open_issues", "watchers", "score", "created_at", "updated_at", "language", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "owners" ("github_id", "url", "html_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def create_owner_from_response(owner_hash)
		owner = Owner.find_by(external_id: owner_hash['id'])
		return owner unless owner.blank?
---
SELECT "owners".* FROM "owners" WHERE "owners"."external_id" = $1 LIMIT $2  [["external_id", 66577], ["LIMIT", 1]]
SELECT "owners".* FROM "owners" WHERE "owners"."github_id" = $1 LIMIT $2  [["github_id", 36260787], ["LIMIT", 1]]
SELECT 1 AS one FROM "owners" WHERE "owners"."external_id" = $1 LIMIT $2  [["external_id", 582346], ["LIMIT", 1]]