app/controllers/owner_controller.rb

  def show
    @owner = Owner.find(params[:format])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]