app/controllers/repositories_controller.rb

SELECT "repositories".* FROM "repositories"
---
  def index
    #TODO: uncomment this
    service = GithubService.new
    service.search_repositories_from_languages

    @repositories = Repository.all

SELECT "repositories".* FROM "repositories" WHERE "repositories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @repository = Repository.find(params[:format])